apache/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_uarte.h
/****************************************************************************
 * arch/arm/src/nrf54l/hardware/nrf54l_uarte.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_NRF54L_HARDWARE_NRF54L_UARTE_H
#define __ARCH_ARM_SRC_NRF54L_HARDWARE_NRF54L_UARTE_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "nrf54l_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define NRF54L_UARTE_TASKS_FLUSHRX_OFFSET                    0x001c              /* Flush RX FIFO to DMA buffer */
#define NRF54L_UARTE_TASKS_STARTRX_OFFSET                    0x0028              /* Start reception */
#define NRF54L_UARTE_TASKS_STOPRX_OFFSET                     0x002c              /* Stop reception */
#define NRF54L_UARTE_TASKS_DMA_RX_ENABLEMATCH_OFFSET(n)      (0x0030 + 4 * (n))  /* Enable RX match event n */
#define NRF54L_UARTE_TASKS_DMA_RX_DISABLEMATCH_OFFSET(n)     (0x0040 + 4 * (n))  /* Disable RX match event n */
#define NRF54L_UARTE_TASKS_STARTTX_OFFSET                    0x0050              /* Start transmission */
#define NRF54L_UARTE_TASKS_STOPTX_OFFSET                     0x0054              /* Stop transmission */
#define NRF54L_UARTE_SUBSCRIBE_FLUSHRX_OFFSET                0x009c              /* Subscribe to FLUSHRX task */
#define NRF54L_UARTE_SUBSCRIBE_DMA_RX_START_OFFSET           0x00a8              /* Subscribe to RX START task */
#define NRF54L_UARTE_SUBSCRIBE_DMA_RX_STOP_OFFSET            0x00ac              /* Subscribe to RX STOP task */
#define NRF54L_UARTE_SUBSCRIBE_DMA_RX_ENABLEMATCH_OFFSET(n)  (0x00b0 + 4 * (n))  /* Subscribe to RX ENABLEMATCH task n */
#define NRF54L_UARTE_SUBSCRIBE_DMA_RX_DISABLEMATCH_OFFSET(n) (0x00c0 + 4 * (n))  /* Subscribe to RX DISABLEMATCH task n */
#define NRF54L_UARTE_SUBSCRIBE_DMA_TX_START_OFFSET           0x00d0              /* Subscribe to TX START task */
#define NRF54L_UARTE_SUBSCRIBE_DMA_TX_STOP_OFFSET            0x00d4              /* Subscribe to TX STOP task */
#define NRF54L_UARTE_EVENTS_CTS_OFFSET                       0x0100              /* CTS asserted */
#define NRF54L_UARTE_EVENTS_NCTS_OFFSET                      0x0104              /* CTS deasserted */
#define NRF54L_UARTE_EVENTS_TXDRDY_OFFSET                    0x010c              /* Byte transmitted */
#define NRF54L_UARTE_EVENTS_RXDRDY_OFFSET                    0x0110              /* Byte received */
#define NRF54L_UARTE_EVENTS_ERROR_OFFSET                     0x0114              /* Receive error */
#define NRF54L_UARTE_EVENTS_RXTO_OFFSET                      0x0124              /* Receiver stopped */
#define NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET                 0x0130              /* Transmitter stopped */
#define NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET                0x014c              /* RX DMA buffer completed */
#define NRF54L_UARTE_EVENTS_DMA_RX_READY_OFFSET              0x0150              /* RX DMA buffer prepared */
#define NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET           0x0154              /* RX DMA bus error */
#define NRF54L_UARTE_EVENTS_DMA_RX_MATCH_OFFSET(n)           (0x0158 + 4 * (n))  /* RX data matched candidate n */
#define NRF54L_UARTE_EVENTS_DMA_TX_END_OFFSET                0x0168              /* TX DMA buffer completed */
#define NRF54L_UARTE_EVENTS_DMA_TX_READY_OFFSET              0x016c              /* TX DMA buffer prepared */
#define NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET           0x0170              /* TX DMA bus error */
#define NRF54L_UARTE_EVENTS_FRAMETIMEOUT_OFFSET              0x0174              /* Receive frame timed out */
#define NRF54L_UARTE_PUBLISH_CTS_OFFSET                      0x0180              /* Publish CTS event */
#define NRF54L_UARTE_PUBLISH_NCTS_OFFSET                     0x0184              /* Publish NCTS event */
#define NRF54L_UARTE_PUBLISH_TXDRDY_OFFSET                   0x018c              /* Publish TXDRDY event */
#define NRF54L_UARTE_PUBLISH_RXDRDY_OFFSET                   0x0190              /* Publish RXDRDY event */
#define NRF54L_UARTE_PUBLISH_ERROR_OFFSET                    0x0194              /* Publish ERROR event */
#define NRF54L_UARTE_PUBLISH_RXTO_OFFSET                     0x01a4              /* Publish RXTO event */
#define NRF54L_UARTE_PUBLISH_TXSTOPPED_OFFSET                0x01b0              /* Publish TXSTOPPED event */
#define NRF54L_UARTE_PUBLISH_DMA_RX_END_OFFSET               0x01cc              /* Publish RX END event */
#define NRF54L_UARTE_PUBLISH_DMA_RX_READY_OFFSET             0x01d0              /* Publish RX READY event */
#define NRF54L_UARTE_PUBLISH_DMA_RX_BUSERROR_OFFSET          0x01d4              /* Publish RX BUSERROR event */
#define NRF54L_UARTE_PUBLISH_DMA_RX_MATCH_OFFSET(n)          (0x01d8 + 4 * (n))  /* Publish RX MATCH event n */
#define NRF54L_UARTE_PUBLISH_DMA_TX_END_OFFSET               0x01e8              /* Publish TX END event */
#define NRF54L_UARTE_PUBLISH_DMA_TX_READY_OFFSET             0x01ec              /* Publish TX READY event */
#define NRF54L_UARTE_PUBLISH_DMA_TX_BUSERROR_OFFSET          0x01f0              /* Publish TX BUSERROR event */
#define NRF54L_UARTE_PUBLISH_FRAMETIMEOUT_OFFSET             0x01f4              /* Publish FRAMETIMEOUT event */
#define NRF54L_UARTE_SHORTS_OFFSET                           0x0200              /* Shortcuts between local events and tasks */
#define NRF54L_UARTE_INTEN_OFFSET                            0x0300              /* Enable or disable interrupts */
#define NRF54L_UARTE_INTENSET_OFFSET                         0x0304              /* Enable interrupts */
#define NRF54L_UARTE_INTENCLR_OFFSET                         0x0308              /* Disable interrupts */
#define NRF54L_UARTE_ERRORSRC_OFFSET                         0x0480              /* Receive error source */
#define NRF54L_UARTE_ENABLE_OFFSET                           0x0500              /* Enable UARTE */
#define NRF54L_UARTE_BAUDRATE_OFFSET                         0x0524              /* Baud rate */
#define NRF54L_UARTE_CONFIG_OFFSET                           0x056c              /* Frame and flow control configuration */
#define NRF54L_UARTE_ADDRESS_OFFSET                          0x0574              /* Address match configuration */
#define NRF54L_UARTE_FRAMETIMEOUT_OFFSET                     0x0578              /* Receive frame timeout */
#define NRF54L_UARTE_PSEL_TXD_OFFSET                         0x0604              /* Pin select for TXD */
#define NRF54L_UARTE_PSEL_CTS_OFFSET                         0x0608              /* Pin select for CTS */
#define NRF54L_UARTE_PSEL_RXD_OFFSET                         0x060c              /* Pin select for RXD */
#define NRF54L_UARTE_PSEL_RTS_OFFSET                         0x0610              /* Pin select for RTS */
#define NRF54L_UARTE_DMA_RX_PTR_OFFSET                       0x0704              /* RX DMA buffer address */
#define NRF54L_UARTE_DMA_RX_MAXCNT_OFFSET                    0x0708              /* RX DMA buffer size in bytes */
#define NRF54L_UARTE_DMA_RX_AMOUNT_OFFSET                    0x070c              /* Number of bytes received by DMA */
#define NRF54L_UARTE_DMA_RX_LIST_OFFSET                      0x0714              /* RX DMA list type */
#define NRF54L_UARTE_DMA_RX_TERMINATEONBUSERROR_OFFSET       0x071c              /* Terminate RX DMA on bus error */
#define NRF54L_UARTE_DMA_RX_BUSERRORADDRESS_OFFSET           0x0720              /* Address of last RX DMA bus error */
#define NRF54L_UARTE_DMA_RX_MATCH_CONFIG_OFFSET              0x0724              /* RX DMA match configuration */
#define NRF54L_UARTE_DMA_RX_MATCH_CANDIDATE_OFFSET(n)        (0x0728 + 4 * (n))  /* RX DMA match candidate n */
#define NRF54L_UARTE_DMA_TX_PTR_OFFSET                       0x073c              /* TX DMA buffer address */
#define NRF54L_UARTE_DMA_TX_MAXCNT_OFFSET                    0x0740              /* TX DMA buffer size in bytes */
#define NRF54L_UARTE_DMA_TX_AMOUNT_OFFSET                    0x0744              /* Number of bytes transmitted by DMA */
#define NRF54L_UARTE_DMA_TX_LIST_OFFSET                      0x074c              /* TX DMA list type */
#define NRF54L_UARTE_DMA_TX_TERMINATEONBUSERROR_OFFSET       0x0754              /* Terminate TX DMA on bus error */
#define NRF54L_UARTE_DMA_TX_BUSERRORADDRESS_OFFSET           0x0758              /* Address of last TX DMA bus error */

