apache/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_uarte.h
#define NRF54L_UART2_TASKS_FLUSHRX                    (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_FLUSHRX_OFFSET)
#define NRF54L_UART2_TASKS_STARTRX                    (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_STARTRX_OFFSET)
#define NRF54L_UART2_TASKS_STOPRX                     (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_STOPRX_OFFSET)
#define NRF54L_UART2_TASKS_DMA_RX_ENABLEMATCH(n)      (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART2_TASKS_DMA_RX_DISABLEMATCH(n)     (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART2_TASKS_STARTTX                    (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_STARTTX_OFFSET)
#define NRF54L_UART2_TASKS_STOPTX                     (NRF54L_UART2_BASE + NRF54L_UARTE_TASKS_STOPTX_OFFSET)
#define NRF54L_UART2_SUBSCRIBE_FLUSHRX                (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_FLUSHRX_OFFSET)
#define NRF54L_UART2_SUBSCRIBE_DMA_RX_START           (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_START_OFFSET)
#define NRF54L_UART2_SUBSCRIBE_DMA_RX_STOP            (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_STOP_OFFSET)
#define NRF54L_UART2_SUBSCRIBE_DMA_RX_ENABLEMATCH(n)  (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART2_SUBSCRIBE_DMA_RX_DISABLEMATCH(n) (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART2_SUBSCRIBE_DMA_TX_START           (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_START_OFFSET)
#define NRF54L_UART2_SUBSCRIBE_DMA_TX_STOP            (NRF54L_UART2_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_STOP_OFFSET)
#define NRF54L_UART2_EVENTS_CTS                       (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_CTS_OFFSET)
#define NRF54L_UART2_EVENTS_NCTS                      (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_NCTS_OFFSET)
#define NRF54L_UART2_EVENTS_TXDRDY                    (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_TXDRDY_OFFSET)
#define NRF54L_UART2_EVENTS_RXDRDY                    (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_RXDRDY_OFFSET)
#define NRF54L_UART2_EVENTS_ERROR                     (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_ERROR_OFFSET)
#define NRF54L_UART2_EVENTS_RXTO                      (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_RXTO_OFFSET)
#define NRF54L_UART2_EVENTS_TXSTOPPED                 (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET)
#define NRF54L_UART2_EVENTS_DMA_RX_END                (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET)
#define NRF54L_UART2_EVENTS_DMA_RX_READY              (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_RX_READY_OFFSET)
#define NRF54L_UART2_EVENTS_DMA_RX_BUSERROR           (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART2_EVENTS_DMA_RX_MATCH(n)           (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART2_EVENTS_DMA_TX_END                (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_TX_END_OFFSET)
#define NRF54L_UART2_EVENTS_DMA_TX_READY              (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_TX_READY_OFFSET)
#define NRF54L_UART2_EVENTS_DMA_TX_BUSERROR           (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART2_EVENTS_FRAMETIMEOUT              (NRF54L_UART2_BASE + NRF54L_UARTE_EVENTS_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART2_PUBLISH_CTS                      (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_CTS_OFFSET)
#define NRF54L_UART2_PUBLISH_NCTS                     (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_NCTS_OFFSET)
#define NRF54L_UART2_PUBLISH_TXDRDY                   (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_TXDRDY_OFFSET)
#define NRF54L_UART2_PUBLISH_RXDRDY                   (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_RXDRDY_OFFSET)
#define NRF54L_UART2_PUBLISH_ERROR                    (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_ERROR_OFFSET)
#define NRF54L_UART2_PUBLISH_RXTO                     (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_RXTO_OFFSET)
#define NRF54L_UART2_PUBLISH_TXSTOPPED                (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_TXSTOPPED_OFFSET)
#define NRF54L_UART2_PUBLISH_DMA_RX_END               (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_END_OFFSET)
#define NRF54L_UART2_PUBLISH_DMA_RX_READY             (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_READY_OFFSET)
#define NRF54L_UART2_PUBLISH_DMA_RX_BUSERROR          (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART2_PUBLISH_DMA_RX_MATCH(n)          (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART2_PUBLISH_DMA_TX_END               (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_END_OFFSET)
#define NRF54L_UART2_PUBLISH_DMA_TX_READY             (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_READY_OFFSET)
#define NRF54L_UART2_PUBLISH_DMA_TX_BUSERROR          (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART2_PUBLISH_FRAMETIMEOUT             (NRF54L_UART2_BASE + NRF54L_UARTE_PUBLISH_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART2_SHORTS                           (NRF54L_UART2_BASE + NRF54L_UARTE_SHORTS_OFFSET)
#define NRF54L_UART2_INTEN                            (NRF54L_UART2_BASE + NRF54L_UARTE_INTEN_OFFSET)
#define NRF54L_UART2_INTENSET                         (NRF54L_UART2_BASE + NRF54L_UARTE_INTENSET_OFFSET)
#define NRF54L_UART2_INTENCLR                         (NRF54L_UART2_BASE + NRF54L_UARTE_INTENCLR_OFFSET)
#define NRF54L_UART2_ERRORSRC                         (NRF54L_UART2_BASE + NRF54L_UARTE_ERRORSRC_OFFSET)
#define NRF54L_UART2_ENABLE                           (NRF54L_UART2_BASE + NRF54L_UARTE_ENABLE_OFFSET)
#define NRF54L_UART2_BAUDRATE                         (NRF54L_UART2_BASE + NRF54L_UARTE_BAUDRATE_OFFSET)
#define NRF54L_UART2_CONFIG                           (NRF54L_UART2_BASE + NRF54L_UARTE_CONFIG_OFFSET)
#define NRF54L_UART2_ADDRESS                          (NRF54L_UART2_BASE + NRF54L_UARTE_ADDRESS_OFFSET)
#define NRF54L_UART2_FRAMETIMEOUT                     (NRF54L_UART2_BASE + NRF54L_UARTE_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART2_PSEL_TXD                         (NRF54L_UART2_BASE + NRF54L_UARTE_PSEL_TXD_OFFSET)
#define NRF54L_UART2_PSEL_CTS                         (NRF54L_UART2_BASE + NRF54L_UARTE_PSEL_CTS_OFFSET)
#define NRF54L_UART2_PSEL_RXD                         (NRF54L_UART2_BASE + NRF54L_UARTE_PSEL_RXD_OFFSET)
#define NRF54L_UART2_PSEL_RTS                         (NRF54L_UART2_BASE + NRF54L_UARTE_PSEL_RTS_OFFSET)
#define NRF54L_UART2_DMA_RX_PTR                       (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_PTR_OFFSET)
#define NRF54L_UART2_DMA_RX_MAXCNT                    (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_MAXCNT_OFFSET)
#define NRF54L_UART2_DMA_RX_AMOUNT                    (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_AMOUNT_OFFSET)
#define NRF54L_UART2_DMA_RX_LIST                      (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_LIST_OFFSET)
#define NRF54L_UART2_DMA_RX_TERMINATEONBUSERROR       (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART2_DMA_RX_BUSERRORADDRESS           (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_BUSERRORADDRESS_OFFSET)
#define NRF54L_UART2_DMA_RX_MATCH_CONFIG              (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_MATCH_CONFIG_OFFSET)
#define NRF54L_UART2_DMA_RX_MATCH_CANDIDATE(n)        (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_RX_MATCH_CANDIDATE_OFFSET(n))
#define NRF54L_UART2_DMA_TX_PTR                       (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_TX_PTR_OFFSET)
#define NRF54L_UART2_DMA_TX_MAXCNT                    (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_TX_MAXCNT_OFFSET)
#define NRF54L_UART2_DMA_TX_AMOUNT                    (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_TX_AMOUNT_OFFSET)
#define NRF54L_UART2_DMA_TX_LIST                      (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_TX_LIST_OFFSET)
#define NRF54L_UART2_DMA_TX_TERMINATEONBUSERROR       (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_TX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART2_DMA_TX_BUSERRORADDRESS           (NRF54L_UART2_BASE + NRF54L_UARTE_DMA_TX_BUSERRORADDRESS_OFFSET)

#define NRF54L_UART3_TASKS_FLUSHRX                    (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_FLUSHRX_OFFSET)
#define NRF54L_UART3_TASKS_STARTRX                    (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_STARTRX_OFFSET)
#define NRF54L_UART3_TASKS_STOPRX                     (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_STOPRX_OFFSET)
#define NRF54L_UART3_TASKS_DMA_RX_ENABLEMATCH(n)      (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART3_TASKS_DMA_RX_DISABLEMATCH(n)     (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART3_TASKS_STARTTX                    (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_STARTTX_OFFSET)
#define NRF54L_UART3_TASKS_STOPTX                     (NRF54L_UART3_BASE + NRF54L_UARTE_TASKS_STOPTX_OFFSET)
#define NRF54L_UART3_SUBSCRIBE_FLUSHRX                (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_FLUSHRX_OFFSET)
#define NRF54L_UART3_SUBSCRIBE_DMA_RX_START           (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_START_OFFSET)
#define NRF54L_UART3_SUBSCRIBE_DMA_RX_STOP            (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_STOP_OFFSET)
#define NRF54L_UART3_SUBSCRIBE_DMA_RX_ENABLEMATCH(n)  (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART3_SUBSCRIBE_DMA_RX_DISABLEMATCH(n) (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART3_SUBSCRIBE_DMA_TX_START           (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_START_OFFSET)
#define NRF54L_UART3_SUBSCRIBE_DMA_TX_STOP            (NRF54L_UART3_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_STOP_OFFSET)
#define NRF54L_UART3_EVENTS_CTS                       (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_CTS_OFFSET)
#define NRF54L_UART3_EVENTS_NCTS                      (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_NCTS_OFFSET)
#define NRF54L_UART3_EVENTS_TXDRDY                    (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_TXDRDY_OFFSET)
#define NRF54L_UART3_EVENTS_RXDRDY                    (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_RXDRDY_OFFSET)
#define NRF54L_UART3_EVENTS_ERROR                     (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_ERROR_OFFSET)
#define NRF54L_UART3_EVENTS_RXTO                      (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_RXTO_OFFSET)
#define NRF54L_UART3_EVENTS_TXSTOPPED                 (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET)
#define NRF54L_UART3_EVENTS_DMA_RX_END                (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET)
#define NRF54L_UART3_EVENTS_DMA_RX_READY              (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_RX_READY_OFFSET)
#define NRF54L_UART3_EVENTS_DMA_RX_BUSERROR           (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART3_EVENTS_DMA_RX_MATCH(n)           (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART3_EVENTS_DMA_TX_END                (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_TX_END_OFFSET)
#define NRF54L_UART3_EVENTS_DMA_TX_READY              (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_TX_READY_OFFSET)
#define NRF54L_UART3_EVENTS_DMA_TX_BUSERROR           (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART3_EVENTS_FRAMETIMEOUT              (NRF54L_UART3_BASE + NRF54L_UARTE_EVENTS_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART3_PUBLISH_CTS                      (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_CTS_OFFSET)
#define NRF54L_UART3_PUBLISH_NCTS                     (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_NCTS_OFFSET)
#define NRF54L_UART3_PUBLISH_TXDRDY                   (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_TXDRDY_OFFSET)
#define NRF54L_UART3_PUBLISH_RXDRDY                   (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_RXDRDY_OFFSET)
#define NRF54L_UART3_PUBLISH_ERROR                    (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_ERROR_OFFSET)
#define NRF54L_UART3_PUBLISH_RXTO                     (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_RXTO_OFFSET)
#define NRF54L_UART3_PUBLISH_TXSTOPPED                (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_TXSTOPPED_OFFSET)
#define NRF54L_UART3_PUBLISH_DMA_RX_END               (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_END_OFFSET)
#define NRF54L_UART3_PUBLISH_DMA_RX_READY             (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_READY_OFFSET)
#define NRF54L_UART3_PUBLISH_DMA_RX_BUSERROR          (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART3_PUBLISH_DMA_RX_MATCH(n)          (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART3_PUBLISH_DMA_TX_END               (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_END_OFFSET)
#define NRF54L_UART3_PUBLISH_DMA_TX_READY             (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_READY_OFFSET)
#define NRF54L_UART3_PUBLISH_DMA_TX_BUSERROR          (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART3_PUBLISH_FRAMETIMEOUT             (NRF54L_UART3_BASE + NRF54L_UARTE_PUBLISH_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART3_SHORTS                           (NRF54L_UART3_BASE + NRF54L_UARTE_SHORTS_OFFSET)
#define NRF54L_UART3_INTEN                            (NRF54L_UART3_BASE + NRF54L_UARTE_INTEN_OFFSET)
#define NRF54L_UART3_INTENSET                         (NRF54L_UART3_BASE + NRF54L_UARTE_INTENSET_OFFSET)
#define NRF54L_UART3_INTENCLR                         (NRF54L_UART3_BASE + NRF54L_UARTE_INTENCLR_OFFSET)
#define NRF54L_UART3_ERRORSRC                         (NRF54L_UART3_BASE + NRF54L_UARTE_ERRORSRC_OFFSET)
#define NRF54L_UART3_ENABLE                           (NRF54L_UART3_BASE + NRF54L_UARTE_ENABLE_OFFSET)
#define NRF54L_UART3_BAUDRATE                         (NRF54L_UART3_BASE + NRF54L_UARTE_BAUDRATE_OFFSET)
#define NRF54L_UART3_CONFIG                           (NRF54L_UART3_BASE + NRF54L_UARTE_CONFIG_OFFSET)
#define NRF54L_UART3_ADDRESS                          (NRF54L_UART3_BASE + NRF54L_UARTE_ADDRESS_OFFSET)
#define NRF54L_UART3_FRAMETIMEOUT                     (NRF54L_UART3_BASE + NRF54L_UARTE_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART3_PSEL_TXD                         (NRF54L_UART3_BASE + NRF54L_UARTE_PSEL_TXD_OFFSET)
#define NRF54L_UART3_PSEL_CTS                         (NRF54L_UART3_BASE + NRF54L_UARTE_PSEL_CTS_OFFSET)
#define NRF54L_UART3_PSEL_RXD                         (NRF54L_UART3_BASE + NRF54L_UARTE_PSEL_RXD_OFFSET)
#define NRF54L_UART3_PSEL_RTS                         (NRF54L_UART3_BASE + NRF54L_UARTE_PSEL_RTS_OFFSET)
#define NRF54L_UART3_DMA_RX_PTR                       (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_PTR_OFFSET)
#define NRF54L_UART3_DMA_RX_MAXCNT                    (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_MAXCNT_OFFSET)
#define NRF54L_UART3_DMA_RX_AMOUNT                    (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_AMOUNT_OFFSET)
#define NRF54L_UART3_DMA_RX_LIST                      (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_LIST_OFFSET)
#define NRF54L_UART3_DMA_RX_TERMINATEONBUSERROR       (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART3_DMA_RX_BUSERRORADDRESS           (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_BUSERRORADDRESS_OFFSET)
#define NRF54L_UART3_DMA_RX_MATCH_CONFIG              (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_MATCH_CONFIG_OFFSET)
#define NRF54L_UART3_DMA_RX_MATCH_CANDIDATE(n)        (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_RX_MATCH_CANDIDATE_OFFSET(n))
#define NRF54L_UART3_DMA_TX_PTR                       (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_TX_PTR_OFFSET)
#define NRF54L_UART3_DMA_TX_MAXCNT                    (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_TX_MAXCNT_OFFSET)
#define NRF54L_UART3_DMA_TX_AMOUNT                    (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_TX_AMOUNT_OFFSET)
#define NRF54L_UART3_DMA_TX_LIST                      (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_TX_LIST_OFFSET)
#define NRF54L_UART3_DMA_TX_TERMINATEONBUSERROR       (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_TX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART3_DMA_TX_BUSERRORADDRESS           (NRF54L_UART3_BASE + NRF54L_UARTE_DMA_TX_BUSERRORADDRESS_OFFSET)

