apache/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_uarte.h
#define NRF54L_UART4_TASKS_FLUSHRX                    (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_FLUSHRX_OFFSET)
#define NRF54L_UART4_TASKS_STARTRX                    (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_STARTRX_OFFSET)
#define NRF54L_UART4_TASKS_STOPRX                     (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_STOPRX_OFFSET)
#define NRF54L_UART4_TASKS_DMA_RX_ENABLEMATCH(n)      (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART4_TASKS_DMA_RX_DISABLEMATCH(n)     (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART4_TASKS_STARTTX                    (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_STARTTX_OFFSET)
#define NRF54L_UART4_TASKS_STOPTX                     (NRF54L_UART4_BASE + NRF54L_UARTE_TASKS_STOPTX_OFFSET)
#define NRF54L_UART4_SUBSCRIBE_FLUSHRX                (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_FLUSHRX_OFFSET)
#define NRF54L_UART4_SUBSCRIBE_DMA_RX_START           (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_START_OFFSET)
#define NRF54L_UART4_SUBSCRIBE_DMA_RX_STOP            (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_STOP_OFFSET)
#define NRF54L_UART4_SUBSCRIBE_DMA_RX_ENABLEMATCH(n)  (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART4_SUBSCRIBE_DMA_RX_DISABLEMATCH(n) (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART4_SUBSCRIBE_DMA_TX_START           (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_START_OFFSET)
#define NRF54L_UART4_SUBSCRIBE_DMA_TX_STOP            (NRF54L_UART4_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_STOP_OFFSET)
#define NRF54L_UART4_EVENTS_CTS                       (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_CTS_OFFSET)
#define NRF54L_UART4_EVENTS_NCTS                      (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_NCTS_OFFSET)
#define NRF54L_UART4_EVENTS_TXDRDY                    (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_TXDRDY_OFFSET)
#define NRF54L_UART4_EVENTS_RXDRDY                    (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_RXDRDY_OFFSET)
#define NRF54L_UART4_EVENTS_ERROR                     (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_ERROR_OFFSET)
#define NRF54L_UART4_EVENTS_RXTO                      (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_RXTO_OFFSET)
#define NRF54L_UART4_EVENTS_TXSTOPPED                 (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET)
#define NRF54L_UART4_EVENTS_DMA_RX_END                (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET)
#define NRF54L_UART4_EVENTS_DMA_RX_READY              (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_RX_READY_OFFSET)
#define NRF54L_UART4_EVENTS_DMA_RX_BUSERROR           (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART4_EVENTS_DMA_RX_MATCH(n)           (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART4_EVENTS_DMA_TX_END                (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_TX_END_OFFSET)
#define NRF54L_UART4_EVENTS_DMA_TX_READY              (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_TX_READY_OFFSET)
#define NRF54L_UART4_EVENTS_DMA_TX_BUSERROR           (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART4_EVENTS_FRAMETIMEOUT              (NRF54L_UART4_BASE + NRF54L_UARTE_EVENTS_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART4_PUBLISH_CTS                      (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_CTS_OFFSET)
#define NRF54L_UART4_PUBLISH_NCTS                     (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_NCTS_OFFSET)
#define NRF54L_UART4_PUBLISH_TXDRDY                   (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_TXDRDY_OFFSET)
#define NRF54L_UART4_PUBLISH_RXDRDY                   (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_RXDRDY_OFFSET)
#define NRF54L_UART4_PUBLISH_ERROR                    (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_ERROR_OFFSET)
#define NRF54L_UART4_PUBLISH_RXTO                     (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_RXTO_OFFSET)
#define NRF54L_UART4_PUBLISH_TXSTOPPED                (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_TXSTOPPED_OFFSET)
#define NRF54L_UART4_PUBLISH_DMA_RX_END               (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_END_OFFSET)
#define NRF54L_UART4_PUBLISH_DMA_RX_READY             (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_READY_OFFSET)
#define NRF54L_UART4_PUBLISH_DMA_RX_BUSERROR          (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART4_PUBLISH_DMA_RX_MATCH(n)          (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART4_PUBLISH_DMA_TX_END               (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_END_OFFSET)
#define NRF54L_UART4_PUBLISH_DMA_TX_READY             (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_READY_OFFSET)
#define NRF54L_UART4_PUBLISH_DMA_TX_BUSERROR          (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART4_PUBLISH_FRAMETIMEOUT             (NRF54L_UART4_BASE + NRF54L_UARTE_PUBLISH_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART4_SHORTS                           (NRF54L_UART4_BASE + NRF54L_UARTE_SHORTS_OFFSET)
#define NRF54L_UART4_INTEN                            (NRF54L_UART4_BASE + NRF54L_UARTE_INTEN_OFFSET)
#define NRF54L_UART4_INTENSET                         (NRF54L_UART4_BASE + NRF54L_UARTE_INTENSET_OFFSET)
#define NRF54L_UART4_INTENCLR                         (NRF54L_UART4_BASE + NRF54L_UARTE_INTENCLR_OFFSET)
#define NRF54L_UART4_ERRORSRC                         (NRF54L_UART4_BASE + NRF54L_UARTE_ERRORSRC_OFFSET)
#define NRF54L_UART4_ENABLE                           (NRF54L_UART4_BASE + NRF54L_UARTE_ENABLE_OFFSET)
#define NRF54L_UART4_BAUDRATE                         (NRF54L_UART4_BASE + NRF54L_UARTE_BAUDRATE_OFFSET)
#define NRF54L_UART4_CONFIG                           (NRF54L_UART4_BASE + NRF54L_UARTE_CONFIG_OFFSET)
#define NRF54L_UART4_ADDRESS                          (NRF54L_UART4_BASE + NRF54L_UARTE_ADDRESS_OFFSET)
#define NRF54L_UART4_FRAMETIMEOUT                     (NRF54L_UART4_BASE + NRF54L_UARTE_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART4_PSEL_TXD                         (NRF54L_UART4_BASE + NRF54L_UARTE_PSEL_TXD_OFFSET)
#define NRF54L_UART4_PSEL_CTS                         (NRF54L_UART4_BASE + NRF54L_UARTE_PSEL_CTS_OFFSET)
#define NRF54L_UART4_PSEL_RXD                         (NRF54L_UART4_BASE + NRF54L_UARTE_PSEL_RXD_OFFSET)
#define NRF54L_UART4_PSEL_RTS                         (NRF54L_UART4_BASE + NRF54L_UARTE_PSEL_RTS_OFFSET)
#define NRF54L_UART4_DMA_RX_PTR                       (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_PTR_OFFSET)
#define NRF54L_UART4_DMA_RX_MAXCNT                    (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_MAXCNT_OFFSET)
#define NRF54L_UART4_DMA_RX_AMOUNT                    (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_AMOUNT_OFFSET)
#define NRF54L_UART4_DMA_RX_LIST                      (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_LIST_OFFSET)
#define NRF54L_UART4_DMA_RX_TERMINATEONBUSERROR       (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART4_DMA_RX_BUSERRORADDRESS           (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_BUSERRORADDRESS_OFFSET)
#define NRF54L_UART4_DMA_RX_MATCH_CONFIG              (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_MATCH_CONFIG_OFFSET)
#define NRF54L_UART4_DMA_RX_MATCH_CANDIDATE(n)        (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_RX_MATCH_CANDIDATE_OFFSET(n))
#define NRF54L_UART4_DMA_TX_PTR                       (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_TX_PTR_OFFSET)
#define NRF54L_UART4_DMA_TX_MAXCNT                    (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_TX_MAXCNT_OFFSET)
#define NRF54L_UART4_DMA_TX_AMOUNT                    (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_TX_AMOUNT_OFFSET)
#define NRF54L_UART4_DMA_TX_LIST                      (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_TX_LIST_OFFSET)
#define NRF54L_UART4_DMA_TX_TERMINATEONBUSERROR       (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_TX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART4_DMA_TX_BUSERRORADDRESS           (NRF54L_UART4_BASE + NRF54L_UARTE_DMA_TX_BUSERRORADDRESS_OFFSET)

#define NRF54L_UART5_TASKS_FLUSHRX                    (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_FLUSHRX_OFFSET)
#define NRF54L_UART5_TASKS_STARTRX                    (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_STARTRX_OFFSET)
#define NRF54L_UART5_TASKS_STOPRX                     (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_STOPRX_OFFSET)
#define NRF54L_UART5_TASKS_DMA_RX_ENABLEMATCH(n)      (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART5_TASKS_DMA_RX_DISABLEMATCH(n)     (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART5_TASKS_STARTTX                    (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_STARTTX_OFFSET)
#define NRF54L_UART5_TASKS_STOPTX                     (NRF54L_UART5_BASE + NRF54L_UARTE_TASKS_STOPTX_OFFSET)
#define NRF54L_UART5_SUBSCRIBE_FLUSHRX                (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_FLUSHRX_OFFSET)
#define NRF54L_UART5_SUBSCRIBE_DMA_RX_START           (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_START_OFFSET)
#define NRF54L_UART5_SUBSCRIBE_DMA_RX_STOP            (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_STOP_OFFSET)
#define NRF54L_UART5_SUBSCRIBE_DMA_RX_ENABLEMATCH(n)  (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_ENABLEMATCH_OFFSET(n))
#define NRF54L_UART5_SUBSCRIBE_DMA_RX_DISABLEMATCH(n) (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_RX_DISABLEMATCH_OFFSET(n))
#define NRF54L_UART5_SUBSCRIBE_DMA_TX_START           (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_START_OFFSET)
#define NRF54L_UART5_SUBSCRIBE_DMA_TX_STOP            (NRF54L_UART5_BASE + NRF54L_UARTE_SUBSCRIBE_DMA_TX_STOP_OFFSET)
#define NRF54L_UART5_EVENTS_CTS                       (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_CTS_OFFSET)
#define NRF54L_UART5_EVENTS_NCTS                      (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_NCTS_OFFSET)
#define NRF54L_UART5_EVENTS_TXDRDY                    (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_TXDRDY_OFFSET)
#define NRF54L_UART5_EVENTS_RXDRDY                    (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_RXDRDY_OFFSET)
#define NRF54L_UART5_EVENTS_ERROR                     (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_ERROR_OFFSET)
#define NRF54L_UART5_EVENTS_RXTO                      (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_RXTO_OFFSET)
#define NRF54L_UART5_EVENTS_TXSTOPPED                 (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET)
#define NRF54L_UART5_EVENTS_DMA_RX_END                (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET)
#define NRF54L_UART5_EVENTS_DMA_RX_READY              (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_RX_READY_OFFSET)
#define NRF54L_UART5_EVENTS_DMA_RX_BUSERROR           (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART5_EVENTS_DMA_RX_MATCH(n)           (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART5_EVENTS_DMA_TX_END                (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_TX_END_OFFSET)
#define NRF54L_UART5_EVENTS_DMA_TX_READY              (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_TX_READY_OFFSET)
#define NRF54L_UART5_EVENTS_DMA_TX_BUSERROR           (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART5_EVENTS_FRAMETIMEOUT              (NRF54L_UART5_BASE + NRF54L_UARTE_EVENTS_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART5_PUBLISH_CTS                      (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_CTS_OFFSET)
#define NRF54L_UART5_PUBLISH_NCTS                     (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_NCTS_OFFSET)
#define NRF54L_UART5_PUBLISH_TXDRDY                   (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_TXDRDY_OFFSET)
#define NRF54L_UART5_PUBLISH_RXDRDY                   (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_RXDRDY_OFFSET)
#define NRF54L_UART5_PUBLISH_ERROR                    (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_ERROR_OFFSET)
#define NRF54L_UART5_PUBLISH_RXTO                     (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_RXTO_OFFSET)
#define NRF54L_UART5_PUBLISH_TXSTOPPED                (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_TXSTOPPED_OFFSET)
#define NRF54L_UART5_PUBLISH_DMA_RX_END               (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_END_OFFSET)
#define NRF54L_UART5_PUBLISH_DMA_RX_READY             (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_READY_OFFSET)
#define NRF54L_UART5_PUBLISH_DMA_RX_BUSERROR          (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_BUSERROR_OFFSET)
#define NRF54L_UART5_PUBLISH_DMA_RX_MATCH(n)          (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_RX_MATCH_OFFSET(n))
#define NRF54L_UART5_PUBLISH_DMA_TX_END               (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_END_OFFSET)
#define NRF54L_UART5_PUBLISH_DMA_TX_READY             (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_READY_OFFSET)
#define NRF54L_UART5_PUBLISH_DMA_TX_BUSERROR          (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_DMA_TX_BUSERROR_OFFSET)
#define NRF54L_UART5_PUBLISH_FRAMETIMEOUT             (NRF54L_UART5_BASE + NRF54L_UARTE_PUBLISH_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART5_SHORTS                           (NRF54L_UART5_BASE + NRF54L_UARTE_SHORTS_OFFSET)
#define NRF54L_UART5_INTEN                            (NRF54L_UART5_BASE + NRF54L_UARTE_INTEN_OFFSET)
#define NRF54L_UART5_INTENSET                         (NRF54L_UART5_BASE + NRF54L_UARTE_INTENSET_OFFSET)
#define NRF54L_UART5_INTENCLR                         (NRF54L_UART5_BASE + NRF54L_UARTE_INTENCLR_OFFSET)
#define NRF54L_UART5_ERRORSRC                         (NRF54L_UART5_BASE + NRF54L_UARTE_ERRORSRC_OFFSET)
#define NRF54L_UART5_ENABLE                           (NRF54L_UART5_BASE + NRF54L_UARTE_ENABLE_OFFSET)
#define NRF54L_UART5_BAUDRATE                         (NRF54L_UART5_BASE + NRF54L_UARTE_BAUDRATE_OFFSET)
#define NRF54L_UART5_CONFIG                           (NRF54L_UART5_BASE + NRF54L_UARTE_CONFIG_OFFSET)
#define NRF54L_UART5_ADDRESS                          (NRF54L_UART5_BASE + NRF54L_UARTE_ADDRESS_OFFSET)
#define NRF54L_UART5_FRAMETIMEOUT                     (NRF54L_UART5_BASE + NRF54L_UARTE_FRAMETIMEOUT_OFFSET)
#define NRF54L_UART5_PSEL_TXD                         (NRF54L_UART5_BASE + NRF54L_UARTE_PSEL_TXD_OFFSET)
#define NRF54L_UART5_PSEL_CTS                         (NRF54L_UART5_BASE + NRF54L_UARTE_PSEL_CTS_OFFSET)
#define NRF54L_UART5_PSEL_RXD                         (NRF54L_UART5_BASE + NRF54L_UARTE_PSEL_RXD_OFFSET)
#define NRF54L_UART5_PSEL_RTS                         (NRF54L_UART5_BASE + NRF54L_UARTE_PSEL_RTS_OFFSET)
#define NRF54L_UART5_DMA_RX_PTR                       (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_PTR_OFFSET)
#define NRF54L_UART5_DMA_RX_MAXCNT                    (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_MAXCNT_OFFSET)
#define NRF54L_UART5_DMA_RX_AMOUNT                    (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_AMOUNT_OFFSET)
#define NRF54L_UART5_DMA_RX_LIST                      (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_LIST_OFFSET)
#define NRF54L_UART5_DMA_RX_TERMINATEONBUSERROR       (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART5_DMA_RX_BUSERRORADDRESS           (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_BUSERRORADDRESS_OFFSET)
#define NRF54L_UART5_DMA_RX_MATCH_CONFIG              (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_MATCH_CONFIG_OFFSET)
#define NRF54L_UART5_DMA_RX_MATCH_CANDIDATE(n)        (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_RX_MATCH_CANDIDATE_OFFSET(n))
#define NRF54L_UART5_DMA_TX_PTR                       (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_TX_PTR_OFFSET)
#define NRF54L_UART5_DMA_TX_MAXCNT                    (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_TX_MAXCNT_OFFSET)
#define NRF54L_UART5_DMA_TX_AMOUNT                    (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_TX_AMOUNT_OFFSET)
#define NRF54L_UART5_DMA_TX_LIST                      (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_TX_LIST_OFFSET)
#define NRF54L_UART5_DMA_TX_TERMINATEONBUSERROR       (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_TX_TERMINATEONBUSERROR_OFFSET)
#define NRF54L_UART5_DMA_TX_BUSERRORADDRESS           (NRF54L_UART5_BASE + NRF54L_UARTE_DMA_TX_BUSERRORADDRESS_OFFSET)

