apache/nuttx/arch/arm/src/nrf54l/hardware/nrf54l_uarte.h
/* SHORTS Register */

#define UARTE_SHORTS_DMA_RX_END_START                   (1 << 5)
#define UARTE_SHORTS_DMA_RX_END_STOP                    (1 << 6)
#define UARTE_SHORTS_DMA_TX_END_STOP                    (1 << 18)
#define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1  (1 << 21)
#define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2  (1 << 22)
#define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3  (1 << 23)
#define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_ENABLEMATCH0  (1 << 24)
#define UARTE_SHORTS_DMA_RX_MATCH0_DMA_RX_DISABLEMATCH0 (1 << 25)
#define UARTE_SHORTS_DMA_RX_MATCH1_DMA_RX_DISABLEMATCH1 (1 << 26)
#define UARTE_SHORTS_DMA_RX_MATCH2_DMA_RX_DISABLEMATCH2 (1 << 27)
#define UARTE_SHORTS_DMA_RX_MATCH3_DMA_RX_DISABLEMATCH3 (1 << 28)
#define UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP           (1 << 29)

/* INTEN/INTENSET/INTENCLR Register */

#define UARTE_INT_CTS             (1 << 0)
#define UARTE_INT_NCTS            (1 << 1)
#define UARTE_INT_TXDRDY          (1 << 3)
#define UARTE_INT_RXDRDY          (1 << 4)
#define UARTE_INT_ERROR           (1 << 5)
#define UARTE_INT_RXTO            (1 << 9)
#define UARTE_INT_TXSTOPPED       (1 << 12)
#define UARTE_INT_DMA_RX_END      (1 << 19)
#define UARTE_INT_DMA_RX_READY    (1 << 20)
#define UARTE_INT_DMA_RX_BUSERROR (1 << 21)
#define UARTE_INT_DMA_RX_MATCH0   (1 << 22)
#define UARTE_INT_DMA_RX_MATCH1   (1 << 23)
#define UARTE_INT_DMA_RX_MATCH2   (1 << 24)
#define UARTE_INT_DMA_RX_MATCH3   (1 << 25)
#define UARTE_INT_DMA_TX_END      (1 << 26)
#define UARTE_INT_DMA_TX_READY    (1 << 27)
#define UARTE_INT_DMA_TX_BUSERROR (1 << 28)
#define UARTE_INT_FRAMETIMEOUT    (1 << 29)

/* ERRORSRC Register */

#define UARTE_ERRORSRC_OVERRUN (1 << 0)
#define UARTE_ERRORSRC_PARITY  (1 << 1)
#define UARTE_ERRORSRC_FRAMING (1 << 2)
#define UARTE_ERRORSRC_BREAK   (1 << 3)

/* ENABLE Register */

#define UARTE_ENABLE_DISABLE (0)
#define UARTE_ENABLE_ENABLE  (8)

/* BAUDRATE Register */

#define UARTE_BAUDRATE_1200    (0x0004f000)
#define UARTE_BAUDRATE_2400    (0x0009d000)
#define UARTE_BAUDRATE_4800    (0x0013b000)
#define UARTE_BAUDRATE_9600    (0x00275000)
#define UARTE_BAUDRATE_14400   (0x003af000)
#define UARTE_BAUDRATE_19200   (0x004ea000)
#define UARTE_BAUDRATE_28800   (0x0075c000)
#define UARTE_BAUDRATE_31250   (0x00800000)
#define UARTE_BAUDRATE_38400   (0x009d0000)
#define UARTE_BAUDRATE_56000   (0x00e50000)
#define UARTE_BAUDRATE_57600   (0x00eb0000)
#define UARTE_BAUDRATE_76800   (0x013a9000)
#define UARTE_BAUDRATE_115200  (0x01d60000)
#define UARTE_BAUDRATE_230400  (0x03b00000)
#define UARTE_BAUDRATE_250000  (0x04000000)
#define UARTE_BAUDRATE_460800  (0x07400000)
#define UARTE_BAUDRATE_921600  (0x0f000000)
#define UARTE_BAUDRATE_1000000 (0x10000000)

/* CONFIG Register */

#define UARTE_CONFIG_HWFC              (1 << 0)
#define UARTE_CONFIG_PARITY_SHIFT      (1)
#define UARTE_CONFIG_PARITY_MASK       (7 << UARTE_CONFIG_PARITY_SHIFT)
#  define UARTE_CONFIG_PARITY_EXCLUDED (0 << UARTE_CONFIG_PARITY_SHIFT)
#  define UARTE_CONFIG_PARITY_INCLUDED (7 << UARTE_CONFIG_PARITY_SHIFT)
#define UARTE_CONFIG_STOP              (1 << 4)
#define UARTE_CONFIG_PARITYTYPE        (1 << 8)
#define UARTE_CONFIG_FRAMESIZE_SHIFT   (9)
#define UARTE_CONFIG_FRAMESIZE_MASK    (0xf << UARTE_CONFIG_FRAMESIZE_SHIFT)
#  define UARTE_CONFIG_FRAMESIZE_4BIT  (4 << UARTE_CONFIG_FRAMESIZE_SHIFT)
#  define UARTE_CONFIG_FRAMESIZE_5BIT  (5 << UARTE_CONFIG_FRAMESIZE_SHIFT)
#  define UARTE_CONFIG_FRAMESIZE_6BIT  (6 << UARTE_CONFIG_FRAMESIZE_SHIFT)
#  define UARTE_CONFIG_FRAMESIZE_7BIT  (7 << UARTE_CONFIG_FRAMESIZE_SHIFT)
#  define UARTE_CONFIG_FRAMESIZE_8BIT  (8 << UARTE_CONFIG_FRAMESIZE_SHIFT)
#  define UARTE_CONFIG_FRAMESIZE_9BIT  (9 << UARTE_CONFIG_FRAMESIZE_SHIFT)
#define UARTE_CONFIG_ENDIAN            (1 << 13)
#define UARTE_CONFIG_FRAMETIMEOUT      (1 << 14)

/* ADDRESS Register */

#define UARTE_ADDRESS_SHIFT (0)
#define UARTE_ADDRESS_MASK  (0xff << UARTE_ADDRESS_SHIFT)

/* FRAMETIMEOUT Register */

#define UARTE_FRAMETIMEOUT_SHIFT (0)
#define UARTE_FRAMETIMEOUT_MASK  (0x3ff << UARTE_FRAMETIMEOUT_SHIFT)

/* PSEL_TXD Register */

#define UARTE_PSEL_TXD_PIN_SHIFT  (0)
#define UARTE_PSEL_TXD_PIN_MASK   (0x1f << UARTE_PSEL_TXD_PIN_SHIFT)
#define UARTE_PSEL_TXD_PORT_SHIFT (5)
#define UARTE_PSEL_TXD_PORT_MASK  (7 << UARTE_PSEL_TXD_PORT_SHIFT)
#define UARTE_PSEL_TXD_CONNECT    (1 << 31)
#define UARTE_PSEL_TXD_RESET      (0xffffffff)

/* PSEL_RXD Register */

#define UARTE_PSEL_RXD_PIN_SHIFT  (0)
#define UARTE_PSEL_RXD_PIN_MASK   (0x1f << UARTE_PSEL_RXD_PIN_SHIFT)
#define UARTE_PSEL_RXD_PORT_SHIFT (5)
#define UARTE_PSEL_RXD_PORT_MASK  (7 << UARTE_PSEL_RXD_PORT_SHIFT)
#define UARTE_PSEL_RXD_CONNECT    (1 << 31)
#define UARTE_PSEL_RXD_RESET      (0xffffffff)

/* PSEL_CTS Register */

#define UARTE_PSEL_CTS_PIN_SHIFT  (0)
#define UARTE_PSEL_CTS_PIN_MASK   (0x1f << UARTE_PSEL_CTS_PIN_SHIFT)
#define UARTE_PSEL_CTS_PORT_SHIFT (5)
#define UARTE_PSEL_CTS_PORT_MASK  (7 << UARTE_PSEL_CTS_PORT_SHIFT)
#define UARTE_PSEL_CTS_CONNECT    (1 << 31)
#define UARTE_PSEL_CTS_RESET      (0xffffffff)

/* PSEL_RTS Register */

#define UARTE_PSEL_RTS_PIN_SHIFT  (0)
#define UARTE_PSEL_RTS_PIN_MASK   (0x1f << UARTE_PSEL_RTS_PIN_SHIFT)
#define UARTE_PSEL_RTS_PORT_SHIFT (5)
#define UARTE_PSEL_RTS_PORT_MASK  (7 << UARTE_PSEL_RTS_PORT_SHIFT)
#define UARTE_PSEL_RTS_CONNECT    (1 << 31)
#define UARTE_PSEL_RTS_RESET      (0xffffffff)

/* DMA_RX_MAXCNT Register */

#define UARTE_DMA_RX_MAXCNT_SHIFT (0)
#define UARTE_DMA_RX_MAXCNT_MASK  (0xffff << UARTE_DMA_RX_MAXCNT_SHIFT)

/* DMA_RX_AMOUNT Register */

#define UARTE_DMA_RX_AMOUNT_SHIFT (0)
#define UARTE_DMA_RX_AMOUNT_MASK  (0xffff << UARTE_DMA_RX_AMOUNT_SHIFT)

/* DMA_RX_LIST Register */

#define UARTE_DMA_RX_LIST_TYPE_SHIFT       (0)
#define UARTE_DMA_RX_LIST_TYPE_MASK        (7 << UARTE_DMA_RX_LIST_TYPE_SHIFT)
#  define UARTE_DMA_RX_LIST_TYPE_DISABLED  (0 << UARTE_DMA_RX_LIST_TYPE_SHIFT)
#  define UARTE_DMA_RX_LIST_TYPE_ARRAYLIST (1 << UARTE_DMA_RX_LIST_TYPE_SHIFT)

/* DMA_RX_TERMINATEONBUSERROR Register */

#define UARTE_DMA_RX_TERMINATEONBUSERROR_ENABLE (1 << 0)

/* DMA_TX_MAXCNT Register */

#define UARTE_DMA_TX_MAXCNT_SHIFT (0)
#define UARTE_DMA_TX_MAXCNT_MASK  (0xffff << UARTE_DMA_TX_MAXCNT_SHIFT)

/* DMA_TX_AMOUNT Register */

#define UARTE_DMA_TX_AMOUNT_SHIFT (0)
#define UARTE_DMA_TX_AMOUNT_MASK  (0xffff << UARTE_DMA_TX_AMOUNT_SHIFT)

/* DMA_TX_LIST Register */

#define UARTE_DMA_TX_LIST_TYPE_SHIFT       (0)
#define UARTE_DMA_TX_LIST_TYPE_MASK        (7 << UARTE_DMA_TX_LIST_TYPE_SHIFT)
#  define UARTE_DMA_TX_LIST_TYPE_DISABLED  (0 << UARTE_DMA_TX_LIST_TYPE_SHIFT)
#  define UARTE_DMA_TX_LIST_TYPE_ARRAYLIST (1 << UARTE_DMA_TX_LIST_TYPE_SHIFT)

/* DMA_TX_TERMINATEONBUSERROR Register */

#define UARTE_DMA_TX_TERMINATEONBUSERROR_ENABLE (1 << 0)

/* DMA_RX_MATCH_CONFIG Register */

#define UARTE_DMA_RX_MATCH_CONFIG_ENABLE0  (1 << 0)
#define UARTE_DMA_RX_MATCH_CONFIG_ENABLE1  (1 << 1)
#define UARTE_DMA_RX_MATCH_CONFIG_ENABLE2  (1 << 2)
#define UARTE_DMA_RX_MATCH_CONFIG_ENABLE3  (1 << 3)
#define UARTE_DMA_RX_MATCH_CONFIG_ONESHOT0 (1 << 16)
#define UARTE_DMA_RX_MATCH_CONFIG_ONESHOT1 (1 << 17)
#define UARTE_DMA_RX_MATCH_CONFIG_ONESHOT2 (1 << 18)
#define UARTE_DMA_RX_MATCH_CONFIG_ONESHOT3 (1 << 19)

/* DMA_RX_MATCH_CANDIDATE Register */

#define UARTE_DMA_RX_MATCH_CANDIDATE_DATA_SHIFT (0)
#define UARTE_DMA_RX_MATCH_CANDIDATE_DATA_MASK  (0xff << UARTE_DMA_RX_MATCH_CANDIDATE_DATA_SHIFT)

/* SUBSCRIBE/PUBLISH Registers */

#define UARTE_DPPI_CHIDX_SHIFT (0)
#define UARTE_DPPI_CHIDX_MASK  (0xff << UARTE_DPPI_CHIDX_SHIFT)
#define UARTE_DPPI_ENABLE      (1 << 31)

#endif /* __ARCH_ARM_SRC_NRF54L_HARDWARE_NRF54L_UARTE_H */
